cases/cfd/fluids/de_vahl_davis_natural_convection_ra1e4/solution/case/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

// Modified (kinematic) pressure for buoyantBoussinesqSimpleFoam. Closed cavity:
// all walls fixedFluxPressure; the solver anchors the level via pRefCell.
dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    hotWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    coldWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    adiabaticWalls
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}
