cases/cfd/fluids/de_vahl_davis_natural_convection_ra1e4/solution/case/system/gradTwall
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object gradTwall;
}
type surfaceFieldValue;
libs (fieldFunctionObjects);
regionType patch;
name hotWall;
operation areaIntegrate;
writeFields false;
writeArea true;
fields (grad(T));
