cases/cfd/fluids/de_vahl_davis_natural_convection_ra1e4/solution/case/Allrun
#!/usr/bin/env bash
set -eo pipefail
cd "$(dirname "$0")"
if ! command -v blockMesh >/dev/null 2>&1; then
    set +u
    source /usr/lib/openfoam/openfoam2412/etc/bashrc
    set -u
fi
blockMesh
checkMesh
buoyantBoussinesqSimpleFoam
postProcess -func 'grad(T)' -latestTime > log.gradT 2>&1
postProcess -func gradTwall -latestTime > log.gradTwall 2>&1
python3 extract_nusselt.py
